/* 計算機概論實務-進階練習作業-作業11 */
/* 製作人：郭柏鋒 */
/* 完成時間：2019/04/11 16:31 */
/*2019/1-2月發票號碼 
特別獎：00106725 
同期統一發票收執聯8位數號碼與特別獎號碼相同者獎金1,000萬元
特獎：90819218，同期統一發票收執聯8位數號碼與特獎號碼相同者獎金200萬元
頭獎1：13440631，同期統一發票收執聯8位數號碼與頭獎號碼相同者獎金20萬元
頭獎2：26650552，同期統一發票收執聯8位數號碼與頭獎號碼相同者獎金20萬元
頭獎3：09775722，同期統一發票收執聯8位數號碼與頭獎號碼相同者獎金20萬元
二獎：同期統一發票收執聯末7位數號碼與頭獎中獎號碼末7位相同者各得獎金4萬元
三獎：同期統一發票收執聯末6位數號碼與頭獎中獎號碼末6位相同者各得獎金1萬元
四獎：同期統一發票收執聯末5位數號碼與頭獎中獎號碼末5位相同者各得獎金4千元
五獎：同期統一發票收執聯末4位數號碼與頭獎中獎號碼末4位相同者各得獎金1千元
六獎：同期統一發票收執聯末3位數號碼與頭獎中獎號碼末3位相同者各得獎金2百元
增開六獎1：809，同期統一發票收執聯末3位數號碼與增開六獎號碼相同者各得獎金2百元
增開六獎2：264，同期統一發票收執聯末3位數號碼與增開六獎號碼相同者各得獎金2百元
*/
#include<stdio.h> //函示庫 
#include<string.h> //等等要進行字串比對，所以引入string.h的標頭檔
 
int main()
{
 
  char te1[10];  //宣告一個字串陣列，特別獎(1000萬)陣列
  char te2[10];  //宣告一個字串陣列，特獎(200萬)的陣列
  char to1[10];  //宣告一個字串陣列，頭獎1(20萬)的陣列
  char to2[10];  //宣告一個字串陣列，頭獎2(20萬)的陣列
  char to3[10];  //宣告一個字串陣列，，頭獎3(20萬)的陣列
  char six1[5];  //宣告一個字串陣列，這裡只能放5個字元，且為增開六獎1(200)的陣列
  char six2[5];  //宣告一個字串陣列，這裡只能放5個字元，且為增開六獎2(200)的陣列
  char number[10]; //發票號碼有10碼 
  // fgets() 從檔案一行一行的讀取資料，共需三個參數，第一個參數為儲存輸入資料的陣列，第二個參數為該行最多幾個字元，第三個參數為指向結構 FILE 的指標
  printf("請輸入特別獎的號碼:"); //輸入特別獎號碼
  fgets(te1,10,stdin); 
 
  printf("請輸入特獎的號碼:"); //輸入特獎的號碼 
  fgets(te2,10,stdin);
 
  printf("請輸入頭獎(一)的號碼:");//輸入頭獎(一)的號碼 
  fgets(to1,10,stdin);
 
  printf("請輸入頭獎(二)的號碼:");//輸入頭獎(二)的號碼  
  fgets(to2,10,stdin); 
 
  printf("請輸入頭獎(三)的號碼:");//輸入頭獎(三)的號碼  
  fgets(to3,10,stdin);
 
  printf("請輸入增開六獎(一)的號碼:");//輸入增開六獎(一)的號碼  
  fgets(six1,5,stdin);
 
  printf("請輸入增開六獎(二)的號碼:");//輸入增開六獎(二)的號碼  
  fgets(six2,5,stdin);
 
  printf("請輸入發票號碼:\n"); //從這裡開始請使用者輸入要對的發票號碼
  
  // strcmp 比對函數
  //strcmp(str1, str2),str1：這是第一個要比較的字符串,str2：這是第二個的字符串進行比較。 
 while(fgets(number,10,stdin)) //只要使用者有輸入號碼就一直執行這個迴圈
 {
        if (strcmp(number,te1)==0) //比對 
        {
           printf("恭喜你中了特別獎!金額為1000萬元!\n");
        }
 
        else if (strcmp(number,te2)==0)//比對 
        {
           printf("恭喜你中了特獎!金額為200萬元!\n");
        }
 
        else if (strcmp(number,to1)==0)//比對 
        {
            printf("恭喜你中了頭獎!金額為20萬元!\n");
        }
 
        else if (strcmp(number,to2)==0)//比對 
        {
            printf("恭喜你中了頭獎!金額為20萬元!\n");
        }
 
        else if (strcmp(number,to3)==0)//比對 
        {
            printf("恭喜你中了頭獎!金額為20萬元!\n");
        }
 
        else if (strncmp(&number[1],&to1[1],7)==0)//比對 
        {
            printf("恭喜你中了二獎!金額為40000元!\n");
        }
 
        else if (strncmp(&number[1],&to2[1],7)==0)//比對 
        {
            printf("恭喜你中了二獎!金額為40000元!\n");
        }
 
        else if (strncmp(&number[1],&to3[1],7)==0)//比對 
        {
            printf("恭喜你中了二獎!金額為40000元!\n");
        }
 
        else if (strncmp(&number[2],&to1[2],6)==0)//比對 
        {
            printf("恭喜你中了三獎!金額為10000元!\n");
        }
 
        else if (strncmp(&number[2],&to2[2],6)==0)//比對 
        {
            printf("恭喜你中了三獎!金額為10000元!\n");
        }
 
        else if (strncmp(&number[2],&to3[2],6)==0)//比對 
        {
            printf("恭喜你中了三獎!金額為10000元!\n");
        }
 
        else if (strncmp(&number[3],&to1[3],5)==0)//比對 
        {
            printf("恭喜你中了四獎!金額為4000元!\n");
        }
 
        else if (strncmp(&number[3],&to2[3],5)==0)//比對 
        {
            printf("恭喜你中了四獎!金額為4000元!\n");
        }
 
        else if (strncmp(&number[3],&to3[3],5)==0)//比對 
        {
            printf("恭喜你中了四獎!金額為4000元!\n");
        }
 
        else if (strncmp(&number[4],&to1[4],4)==0)//比對 
        {
            printf("恭喜你中了五獎!金額為1000元!\n");
        }
 
        else if (strncmp(&number[4],&to2[4],4)==0)//比對 
        {
            printf("恭喜你中了五獎!金額為1000元!\n");
        }
 
        else if (strncmp(&number[4],&to3[4],4)==0)//比對 
        {
            printf("恭喜你中了五獎!金額為1000元!\n");
        }
 
        else if (strncmp(&number[5],&to1[5],3)==0)//比對 
        {
            printf("恭喜你中了六獎!金額為200元!\n");
        }
 
        else if (strncmp(&number[5],&to2[5],3)==0)//比對 
        {
            printf("恭喜你中了六獎!金額為200元!\n");
        }
 
        else if (strncmp(&number[5],&to3[5],3)==0)//比對 
        {
            printf("恭喜你中了六獎!金額為200元!\n");
        }
 
        else if (strncmp(&number[5],&six1[0],3)==0)//比對 
        {
            printf("恭喜你中了增開六獎!金額為200元!\n");
        }
 
        else if (strncmp(&number[5],&six2[0],3)==0)//比對 
        {
            printf("恭喜你中了增開六獎!金額為200元!\n");
        }
 
        else //反之 
        {
            printf("恭喜你!!你沒中!!謝謝惠顧!!\n");
        }
 
        printf("請輸入發票號碼:");  //執行完結果後在讓使用者再輸入別的號碼
 }
        return 0;
}
